// як повинно працювати
//! Актуалність даних одночасно на різних машинах
//! Швидкість
//! Максимальна простота

// При запуску сторінки
function getEemployeeIdtoLocalStorage() {
  // повертає список працівників (для кешу пошуку по коду)
}
// фронт отримує з бекенду список працівників (для кешу пошуку по коду).
// Скан коду + забрати автоентер
// шукаємо працівника в кеші;
function chekEemployeeId() {
  // якщо не знайдено → один раз оновлюємо кеш з бекенду й шукаємо знову;
  // якщо досі не знайдено → показуємо “Користувача не знайдено” й зупиняємось;
  // якщо знайдено → відправляємо на бекенд запит: “дай мені актуальний статус і дозволені дії по цьому коду”.
  google.script.run.getStatusEemployeeId(id); //
}
// бекенд повертає статус і список дозволених дій;
function getStatusEemployeeId(id) {
  // повертає статус і список дозволених дій;
  return { status: "status", typeAction: "Початок / Кінець" };
}

// фронт показує тільки ті кнопки, які дозволені (або одразу одну “Вхід”/“Вихід”).
function showButton(actionType) {}
// Натискання кнопки
// фронт відправляє на бекенд: “застосуй дію X для цього коду”;
function submitForm(actionType, id) {
  // бекенд:
  // читає актуальний статус із БД; readStaus()
  // перевіряє, чи все ще дозволена дія;
  // якщо ок → додає запис у Журнал і оновлює статус у БД;
  // повертає фронту результат і новий статус (або помилку).

  // Повідомлення і локальне оновлення
  //{ name, actionType, date={year day time} } = res;
  return { res };
}

// фронт показує відповідне повідомлення;
function showMessage(res) {
  const { name, actionType, date } = res;
  const textMessage = `${name} ${actionType} ${date.time}`;
  ///
}

// якщо успіх → оновлює в локальному кеші статус працівника (по бажанню).
